p-podsiadly/llvm-stm8/llvm/lib/Target/STM8/STM8DAGToDAGISel.h
#ifndef LLVM_STM8_DAG_TO_DAG_ISEL_H
#define LLVM_STM8_DAG_TO_DAG_ISEL_H

#include "STM8TargetMachine.h"
#include "llvm/CodeGen/SelectionDAGISel.h"
#include "llvm/Support/CodeGen.h"

namespace llvm {

struct STM8AddrMode {
  enum AMType {
    None,
    Indexed,
    SPIndexed,
    FrameIndex,
    DirectMem,
    IndirectMem,
  };

  AMType Type = None;
  SDValue Base, Offset;
};

/**
 * @brief Pass which selects STM8 instructions from the Instruction Selection
 * DAG.
 */
class STM8DAGToDAGISel : public SelectionDAGISel {
public:
  static char ID;

  STM8DAGToDAGISel(STM8TargetMachine &TM, CodeGenOptLevel OptLevel);

  void Select(SDNode *node) override;

// Include the pieces autogenerated from the target description.
#define GET_DAGISEL_DECL
#include "STM8GenDAGISel.inc"

private:
  /// @brief Check if the value is a memory address and information about
  /// addressing mode.
  STM8AddrMode::AMType GetAddrMode(SDValue N, STM8AddrMode &AM) const;

  void selectLoadEffectiveAddr(SDNode *Node);
  bool selectMul(SDNode *Node);

  bool SelectIR16(SDValue N, SDValue &Base) const;
  bool SelectXYDisp(SDNode *Parent, SDValue Addr, SDValue &Base,
                      SDValue &Disp) const;
  bool SelectSPDisp(SDNode *Parent, SDValue Addr, SDValue &Base,
                    SDValue &Disp) const;
};

void initializeSTM8DAGToDAGISelPass(PassRegistry &);

} // namespace llvm

#endif // LLVM_STM8_DAG_TO_DAG_ISEL_H
